#### ImporterIFC Members

---

|  |
| --- |
| ImporterIFC Class   Methods   Properties   See Also |

The  ImporterIFC  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ImporterIFC |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetOptions | Gets the collection of named options set by the importer client. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ProcessIFCProject(IFCAnyHandle) | The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements. |
| Public method | ProcessIFCProject(IFCAnyHandle, IDictionary IFCAnyHandle, ElementId ) |  |
| Public method | SetFile | Sets the handle to the IFC file being created during this import operation. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Document | Gets the document associated with the import. |
| Public property | FullFileName | The full file name of the IFC file to be import. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ImporterIFC Class

Autodesk.Revit.DB.IFC Namespace